Autodesk.Revit.DB.Structure.RebarWorkInstructions.Straight
The bar will be delivered as a straight bar to the site and the shape code is one of the straight Rebar Shapes loaded into the project (e.g. 00).